tutorials/multiphase/cavitatingFoam/ras/throttle/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

interpolationSchemes
{
    default         linear;
}

divSchemes
{
    default         none;
    div(phiv,rho)   Gauss limitedLinear 1;
    div(phi,U)      Gauss limitedLinearV 1;
    div(phiv,omega) Gauss limitedLinear 1;
    div(phiv,k)     Gauss limitedLinear 1;
    div((muEff*dev(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(nuf,rhoU) Gauss linear corrected;
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(Dp,p) Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(1,p)  Gauss linear corrected;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         none;
    p               ;
    rho             ;
}


// ************************************************************************* //
